# taps
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# general
cask "private-internet-access"
brew "lastpass-cli"
cask "lastpass"
brew "gpg"
cask "dropbox"
cask "grandperspective" # Hard drive visualization tool
cask "keypad-layout" # https://github.com/janten/keypad-layout
cask "firefox"
cask "google-chrome"

# improvement engine(s)
brew "jrnl"

# generation engine(s)
brew "mkdocs"
brew "poetry"
brew "openapi-generator"
brew "protobuf"

# peripherals
cask "homebrew/cask-drivers/corsair-icue"

# developer
cask "iterm2"
brew "tmux"
brew "tree"
brew "coreutils"
brew "jq"
brew "watch"
brew "lolcat"

# language runtimes
brew "python"
brew "python3"
brew "go"
brew "nvm"
cask "java"
brew "haskell-stack"
brew "scala"
brew "sbt"

# database runtimes
brew "mysql"
brew "sqlite"

# static analysis
brew "shellcheck"
brew "yamllint"

# VCS junkie
brew "git"
brew "hub"

# IDEs/editors
brew "vim" # I need my "+ register!
cask "jetbrains-toolbox"
cask "visual-studio-code"

# VMs
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
brew "terraform"

# Remote
cask "microsoft-remote-desktop-beta"
cask "vmware-horizon-client"

# cloud native engineering
brew "kubernetes-cli"
brew "istioctl"
brew "helm"
brew "kind"
brew "minikube"
brew "operator-sdk"

# cloud admin
brew "awscli"
cask "google-cloud-sdk"
brew "azure-cli"

# network engineering
brew "nmap"
brew "httpie"
brew "speedtest-cli"

# testing
cask "postman"

# hardware hacking (e.g. arduino)
cask "arduino"
brew "gcc"
cask "gcc-arm-embedded"
brew "dfu-util"
cask "balenaetcher" # GUI to write OS images to SD cards

# artist
cask "adobe-creative-cloud"
cask "openscad"
brew "youtube-dl"
brew "imagemagick"
cask "gifcapture"
brew "ffmpeg"
cask "elgato-game-capture-hd"

# chat ops
cask "discord"
cask "slack"

